x-labz/t-watch/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
# PSRAM follows the flash clock on ESP32 and cannot exceed it, so dropping
# flash to 40MHz (below) forces this to 40M regardless of what is asked for
# here. Stated explicitly so the file does not claim 80M while the build
# silently uses 40M. Acceptable: PSRAM only holds the two full-frame sprites,
# which are occasional redraws — the 30+fps path is the internal-RAM strip
# pipeline (section 8) and is unaffected.
CONFIG_SPIRAM_SPEED_40M=y
# Flash at 40MHz, NOT 80MHz. The ROM bootloader reads flash at the configured
# rate (the boot log's "clock div:1" is 80MHz, div:2 is 40MHz), and at 80MHz
# this unit intermittently fails that read: the boot log shows segment 1
# loading then garbage — "load:0xffffffff,len:-1" / "csum err" / "invalid
# header" — and the RTC watchdog resets the chip (rst:0x10). Espressif's own
# flash-mode docs say 80MHz "may cause crashing if the flash or board design
# is not capable of this speed". Measured on hardware, see section 13.
# This does NOT affect the 80MHz display SPI in section 8 — that is a separate
# peripheral bus and unchanged.
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# Confirmed on hardware 2026-08-24: 16MB flash (Winbond ef/6018) via
# `esptool.py flash_id`, and 8MB PSRAM chip via boot log ("Found 8MB PSRAM
# device") — only 4MB gets mapped into address space, the classic-ESP32 cap
# from section 2, not a property of the chip itself.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BLE scanner view. NimBLE rather than Bluedroid: this board only ever needs
# BLE (no classic BR/EDR), and NimBLE costs far less RAM/flash for that.
# BLE-only controller mode for the same reason. Note this makes the
# esp_bt_controller_mem_release() suggestion in section 9 inapplicable —
# the controller is now used, just kept off between scans.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n

# Lets `pmlocks` show where time is actually spent per frequency, which is how
# section 9's "verify DFS actually engages" check is made. Small overhead on
# every lock operation; turn off once the power work is settled.
CONFIG_PM_PROFILING=y
